<template>
    <div class="faq">
        <div class="faq__container container">
            <div class="faq__left">
                <h2 class="faq__title title-level-2">Часто задаваемые вопросы</h2>
                <p class="faq__descr">
                    А ещё активно развивающиеся страны третьего мира, превозмогая сложившуюся непростую экономическую ситуацию, в равной
                    степени предоставлены сами себе. В целом, конечно, новая модель организационной деятельности говорит о возможностях
                    экономической целесообразности принимаемых решений.
                </p>
            </div>
            <div class="faq__right">
                <UAccordion class="faq__accordion accordion" :items="items" variant="ghost" size="xl" color="black">
           
                    <template #default="{ item, index, open }">
                        <UButton color="gray" variant="ghost" class="accordion__btn">
                            <span class="accordion__btn-text"> {{ item.label }}</span>

                            <template #trailing>
                                <UIcon
                                    :name="!open ? 'i-heroicons-plus' : 'i-heroicons-minus'"
                                    class="w-5 h-5 ms-auto transform transition-transform duration-200"
                                />
                            </template>
                        </UButton>
                    </template>
                    <template #item="{ item }">
                        <p class="accordion__text-body">
                            {{ item.content }}
                        </p>
                    </template>
                </UAccordion>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
const items = [
    {
        label: 'Какие признаки корпоративного спора?',
        defaultOpen: true,
        content:
            'Одним из основных признаков спора является возникновение разногласий между участниками/руководителями или разное видение на создание, управление или участие в бизнесе. В большинстве случаев к корпоративным конфликтам относятся противоречия, возникшие между участниками юридического лица и затрагивающие внутрикорпоративные взаимоотношения.',
    },
    {
        label: 'Какой срок рассмотрения дел по корпоративным спорам?',
        content:
            'Одним из основных признаков спора является возникновение разногласий между участниками/руководителями или разное видение на создание, управление или участие в бизнесе. В большинстве случаев к корпоративным конфликтам относятся противоречия, возникшие между участниками юридического лица и затрагивающие внутрикорпоративные взаимоотношения.',
    },
    {
        label: 'Какие виды корпоративных споров бывают?',
        content:
            'Одним из основных признаков спора является возникновение разногласий между участниками/руководителями или разное видение на создание, управление или участие в бизнесе. В большинстве случаев к корпоративным конфликтам относятся противоречия, возникшие между участниками юридического лица и затрагивающие внутрикорпоративные взаимоотношения.',
    },
    {
        label: 'Почему стоит обращаться за профессиональной юридической помощью?',
        content:
            'Одним из основных признаков спора является возникновение разногласий между участниками/руководителями или разное видение на создание, управление или участие в бизнесе. В большинстве случаев к корпоративным конфликтам относятся противоречия, возникшие между участниками юридического лица и затрагивающие внутрикорпоративные взаимоотношения.',
    },
    {
        label: 'Где рассматриваются корпоративные споры?',
        content:
            'Одним из основных признаков спора является возникновение разногласий между участниками/руководителями или разное видение на создание, управление или участие в бизнесе. В большинстве случаев к корпоративным конфликтам относятся противоречия, возникшие между участниками юридического лица и затрагивающие внутрикорпоративные взаимоотношения.',
    },
];
</script>

<style scoped lang="scss">
@forward './FAQ.scss';
</style>
